# С использованием словаря
import random
import sum_memory

N = 25
MIN_ITEM = 0
MAX_ITEM = 100
array = {k: random.randint(MIN_ITEM, MAX_ITEM) for k, val in enumerate(range(N))}
print(array)

array_index = dict()
for i in range(len(array)):
    if array.get(i) % 2 == 0:
        array_index[i] = array.get(i)
print(f'Массив индексов чётных элементов: {array_index.keys()}')

print('*'*15)
print('Занимаемая память: ')
print(sum_memory.sum_size_objs(i, array) +
      sum_memory.size_obj(array_index))

"""
В 1 задаче:
[94, 85, 36, 54, 31, 53, 82, 6, 59, 97, 7, 63, 3, 6, 65, 60, 19, 99, 73, 53, 21, 14, 42, 8, 43]
Массив индексов чётных элементов: [0, 2, 3, 6, 7, 13, 15, 21, 22, 23]
***************
Занимаемая память: 
1332

Во 2 задаче:
{3, 4, 6, 7, 16, 17, 30, 31, 34, 38, 54, 56, 65, 66, 72, 73, 75, 78, 84, 85, 97}
Массив индексов чётных элементов: {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11}
***************
Занимаемая память: 
3856

В 3 задаче:
{0: 84, 1: 77, 2: 41, 3: 39, 4: 8, 5: 59, 6: 16, 7: 93, 8: 33, 9: 90, 10: 69, 11: 81, 12: 56, 13: 11, 14: 89, 15: 65, 16: 59, 17: 36, 18: 86, 19: 92, 20: 49, 21: 89, 22: 46, 23: 86, 24: 4}
Массив индексов чётных элементов: dict_keys([0, 4, 6, 9, 12, 17, 18, 19, 22, 23, 24])
***************
Занимаемая память: 
3044

Меньше всего в задачах потребляли списки затем словари, больше всего потребляли множество.
"""






